# SF Salaries Exercise

** Import pandas as pd.**

In [2]:
import pandas as pd

** Read Salaries.csv as a dataframe called sal.**

In [69]:
sal =pd.read_csv('Salaries.csv')
sal.drop(['Notes','Status','Benefits'],axis =1,inplace=True)
sal.dropna(axis = 0,inplace=True)
sal.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 148045 entries, 0 to 148653
Data columns (total 10 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148045 non-null  int64
 1   EmployeeName      148045 non-null  object
 2   JobTitle          148045 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148045 non-null  float64
 5   OtherPay          148045 non-null  float64
 6   TotalPay          148045 non-null  float64
 7   TotalPayBenefits  148045 non-null  float64
 8   Year              148045 non-null  int64
 9   Agency            148045 non-null  object
dtypes: float64(5), int64(2), object(3)
memory usage: 12.4+ MB

** Check the head of the DataFrame. **

In [70]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,TotalPay,TotalPayBenefits,Year,Agency
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,567595.43,567595.43,2011,San Francisco
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,538909.28,538909.28,2011,San Francisco
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,335279.91,335279.91,2011,San Francisco
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,332343.61,332343.61,2011,San Francisco
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,326373.19,326373.19,2011,San Francisco

** Use the .info() method to find out how many entries there are.**

In [71]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 148045 entries, 0 to 148653
Data columns (total 10 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148045 non-null  int64
 1   EmployeeName      148045 non-null  object
 2   JobTitle          148045 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148045 non-null  float64
 5   OtherPay          148045 non-null  float64
 6   TotalPay          148045 non-null  float64
 7   TotalPayBenefits  148045 non-null  float64
 8   Year              148045 non-null  int64
 9   Agency            148045 non-null  object
dtypes: float64(5), int64(2), object(3)
memory usage: 12.4+ MB

**What is the average BasePay ?**

In [72]:
sal['BasePay'].mean()

66325.44884048768

** What is the highest amount of OvertimePay in the dataset ? **

In [86]:
sal['OvertimePay'].max()

245131.88

** What is the job title of  JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll). **

In [87]:
sal.query('EmployeeName == "JOSEPH DRISCOLL"')['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

** How much does JOSEPH DRISCOLL make (including benefits)? **

In [96]:
sal[sal['EmployeeName'] == "JOSEPH DRISCOLL"]['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

** What is the name of highest paid person (including benefits)?**

In [98]:
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

** What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?**

In [101]:
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,TotalPay,TotalPayBenefits,Year,Agency
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,-618.13,-618.13,2014,San Francisco

** What was the average (mean) BasePay of all employees per year? (2011-2014) ? **

In [116]:
sal.groupby('Year').mean()

,Id,BasePay,OvertimePay,OtherPay,TotalPay,TotalPayBenefits
Year,,,,,,
2011,18080.000000,63595.956517,4531.065429,3617.081926,71744.103871,71744.103871
2012,54542.500000,65436.406857,5023.417824,3653.437583,74113.262265,100553.229232
2013,91481.627632,69630.030216,5367.913512,3810.341313,78808.285041,102939.981346
2014,129591.000184,66564.421924,5401.993737,3505.421251,75471.836912,100261.438668

** How many unique job titles are there? **

In [126]:
len(sal['JobTitle'].unique())

2154

** What are the top 5 most common jobs? **

In [140]:
sal.groupby(sal['JobTitle']).count()['Id'].nlargest(5)

JobTitle
Transit Operator                6975
Special Nurse                   4382
Registered Nurse                3725
Public Svc Aide-Public Works    2514
Police Officer 3                2411
Name: Id, dtype: int64

** How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?) **

In [177]:
df =sal[sal['Year']==2013]
(df.groupby('JobTitle').count()['Id']==1).sum()

202

** How many people have the word Chief in their job title? (This is pretty tricky) **

In [184]:
sal.JobTitle.str.count('Chief').sum()
#some were filtered out I guess

420

477

** Bonus: Is there a correlation between length of the Job Title string and Salary? **

                  title_len  TotalPayBenefits
title_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000

# Great Job!